#### ComputeAreaOfCurveLoops Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static double ComputeAreaOfCurveLoops( 	IList<CurveLoop> curveLoops ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ComputeAreaOfCurveLoops ( _ 	curveLoops As IList(Of CurveLoop) _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: static double ComputeAreaOfCurveLoops( 	IList<CurveLoop^>^ curveLoops ) ``` |

#### Parameters

curveLoops
:   Type:  System.Collections.Generic IList   CurveLoop

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace